Repository: lyu3239-oss/heartbeat-app
Catalog: frontend/HeartbeatApp/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: Back
zh_hans: 返回

source: User avatar
zh_hans: 用户头像

source: Welcome Back
zh_hans: 欢迎回来

source: Sign in to continue
zh_hans: 登录继续使用

source: Email
zh_hans: 邮箱

source: Enter your email
zh_hans: 请输入邮箱

source: Password
zh_hans: 密码

source: Enter your password
zh_hans: 请输入密码

source: Forgot password?
zh_hans: 忘记密码？

source: Sign In
zh_hans: 登录

source: Don't have an account?
zh_hans: 还没有账号？

source: Sign Up
zh_hans: 立即注册

source: Forgot Password
zh_hans: 忘记密码

source: Verify your email to reset your password
zh_hans: 请验证你的邮箱后重置密码

source: Enter your email address
zh_hans: 请输入邮箱地址

source: Verification Code
zh_hans: 验证码

source: Enter verification code
zh_hans: 请输入邮箱验证码

source: Send Code
zh_hans: 发送验证码

source: New Password
zh_hans: 新密码

source: Set new password (6+ chars)
zh_hans: 请设置新密码（至少6位）

source: Confirm Password
zh_hans: 确认密码

source: Re-enter your password
zh_hans: 请再次输入密码

source: Re-enter new password
zh_hans: 请再次输入新密码

source: Reset Password
zh_hans: 重置密码

source: A verification code will be sent to your email
zh_hans: 验证码将发送到你的邮箱，请注意查收

source: Create Account
zh_hans: 创建账号

source: Fill in the info to sign up
zh_hans: 请填写以下信息完成注册

source: Username
zh_hans: 用户名

source: Enter your username
zh_hans: 请输入用户名

source: Set password (6+ chars)
zh_hans: 请设置密码（至少6位）

source: By signing up, you agree to the
zh_hans: 注册即表示同意

source: Terms of Service
zh_hans: 用户协议

source: and
zh_hans: 和

source: Privacy Policy
zh_hans: 隐私政策

source: Set Emergency Contacts
zh_hans: 设置紧急联系人

source: Add emergency contacts for when they're needed
zh_hans: 添加紧急联系人，以便在需要时联系

source: Emergency Contact 1
zh_hans: 紧急联系人1

source: Emergency Contact 2
zh_hans: 紧急联系人2

source: Add Emergency Contact
zh_hans: 添加紧急联系人

source: We recommend adding at least one emergency contact so your loved ones can be reached in an emergency.
zh_hans: 建议添加至少一位紧急联系人，以便在紧急情况下及时联系到您的亲友。

source: Complete
zh_hans: 完成

source: Skip
zh_hans: 跳过

source: Name not set
zh_hans: 未填写姓名

source: Phone not set
zh_hans: 未填写电话

source: Name
zh_hans: 姓名

source: Enter contact name
zh_hans: 请输入联系人姓名

source: Phone
zh_hans: 电话

source: Enter contact phone
zh_hans: 请输入联系人电话

source: Cancel
zh_hans: 取消

source: Save
zh_hans: 保存

source: Registration Successful!
zh_hans: 注册成功！

source: Welcome! Let's set up your emergency contacts
zh_hans: 欢迎加入，接下来请设置紧急联系人

source: Next
zh_hans: 下一步

source: Change Password
zh_hans: 更改密码

source: Change your password regularly for security
zh_hans: 为了你的账户安全，请定期更换密码

source: Current Password
zh_hans: 当前密码

source: Enter current password
zh_hans: 请输入当前密码

source: Confirm New Password
zh_hans: 确认新密码

source: Confirm Change
zh_hans: 确认修改

source: Passwords do not match
zh_hans: 两次输入的新密码不一致

source: Password Security Tips:
zh_hans: 密码安全提示：

source: • At least 6 characters
zh_hans: • 密码长度至少6位

source: • Mix letters, numbers, and symbols
zh_hans: • 建议包含字母、数字和符号

source: • Avoid overly simple passwords
zh_hans: • 不要使用过于简单的密码

source: • Change passwords regularly
zh_hans: • 定期更换密码以保护账户安全

source: Forgot current password?
zh_hans: 忘记当前密码？

source: Settings
zh_hans: 设置

source: Account Settings
zh_hans: 账户设置

source: Emergency Contacts
zh_hans: 紧急联系人

source: Auto Check-in
zh_hans: 自动打卡

source: General
zh_hans: 通用

source: Language
zh_hans: 语言设置

source: Version 1.0.0
zh_hans: 版本 1.0.0

source: Sign Out
zh_hans: 退出登录

source: Auto check-in when daily steps exceed 100
zh_hans: 每天步数超过100步自动打卡

source: When enabled, walking 100+ steps daily will auto check-in
zh_hans: 开启后，每天行走超过100步将自动完成打卡

source: Auto Check-in Settings
zh_hans: 自动打卡设置

source: Done
zh_hans: 完成

source: Hello, %@
zh_hans: 你好，%@

source: User
zh_hans: 用户

source: Checked in today ✓
zh_hans: 今日已打卡 ✓

source: Not checked in today
zh_hans: 今日未打卡

source: Auto check-in daily
zh_hans: 每天自动为你完成打卡

source: %lld day streak
zh_hans: 连续打卡 %lld 天

source: Keep checking in for a healthy habit
zh_hans: 坚持打卡，养成良好习惯

source: Please enable auto check-in in settings
zh_hans: 请先在设置中开启自动打卡选项

source: Daily steps reached %lld, auto checking in
zh_hans: 今日步数达到%lld，正在自动打卡

source: Device unlock detected, auto checking in
zh_hans: 检测到设备解锁，正在自动打卡

source: Emergency contact triggered (Backend simulation)
zh_hans: 已触发紧急联系（当前为后端模拟）

source: Emergency contact not needed at this time
zh_hans: 暂不需要紧急联系

source: Warning: Not checked in for over 2 days
zh_hans: 注意：已超过2天未打卡

source: Password must be at least 6 characters
zh_hans: 密码长度至少6位
